
## Plan Result (aat)




<pre><code>Plan: 2 to add, 12 to change, 0 to destroy.</code></pre>

* Create
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password
* Update
  * module.wa_task_management_api_database_flexible.azurerm_monitor_action_group.db-alerts-action-group[0]
  * module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_cpu[0]
  * module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_memory[0]
  * module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_storage_utilization[0]
  * module.wa_task_management_api_database_flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.wa_task_management_api_database_flexible.azurerm_resource_group.rg[0]
  * module.wa_task_management_api_database_flexible_replica.azurerm_monitor_action_group.db-alerts-action-group[0]
  * module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_cpu[0]
  * module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_memory[0]
  * module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_storage_utilization[0]
  * module.wa_task_management_api_database_flexible_replica.azurerm_postgresql_flexible_server.pgsql_server
  * module.wa_task_management_api_database_flexible_replica.azurerm_resource_group.rg[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.sdp_db_user.data.azurerm_key_vault.sdp_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "sdp_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "mi-vault-dev"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "mi-dev-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.sdp_db_user.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name will be created
  + resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "cft-task-postgres-db-flexible-replica-read-user-name"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password will be created
  + resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "cft-task-postgres-db-flexible-replica-read-user-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.wa_task_management_api_database_flexible.azurerm_monitor_action_group.db-alerts-action-group[0] will be updated in-place
  ~ resource "azurerm_monitor_action_group" "db-alerts-action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-data-aat/providers/Microsoft.Insights/actionGroups/cft-task-postgres-db-flexible-wa-support"
        name                = "cft-task-postgres-db-flexible-wa-support"
      ~ tags                = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-02-04T17:41:02Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_cpu[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_cpu" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-data-aat/providers/Microsoft.Insights/metricAlerts/db_cpu_percent_cft-task-postgres-db-flexible-aat"
        name                     = "db_cpu_percent_cft-task-postgres-db-flexible-aat"
      ~ tags                     = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-02-04T17:41:02Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_memory[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_memory" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-data-aat/providers/Microsoft.Insights/metricAlerts/db_memory_percent_cft-task-postgres-db-flexible-aat"
        name                     = "db_memory_percent_cft-task-postgres-db-flexible-aat"
      ~ tags                     = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-02-04T17:41:02Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_storage_utilization[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_storage_utilization" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-data-aat/providers/Microsoft.Insights/metricAlerts/db_storage_utilization_cft-task-postgres-db-flexible-aat"
        name                     = "db_storage_utilization_cft-task-postgres-db-flexible-aat"
      ~ tags                     = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-02-04T17:41:02Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-aat"
        name                          = "cft-task-postgres-db-flexible-aat"
      ~ tags                          = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-02-04T17:41:02Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_resource_group.rg[0] will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-data-aat"
        name       = "cft-task-postgres-db-flexible-data-aat"
      ~ tags       = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-02-04T17:41:02Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_monitor_action_group.db-alerts-action-group[0] will be updated in-place
  ~ resource "azurerm_monitor_action_group" "db-alerts-action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-data-aat/providers/Microsoft.Insights/actionGroups/cft-task-postgres-db-flexible-replica-wa-support"
        name                = "cft-task-postgres-db-flexible-replica-wa-support"
      ~ tags                = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-02-04T17:41:02Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_cpu[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_cpu" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-data-aat/providers/Microsoft.Insights/metricAlerts/db_cpu_percent_cft-task-postgres-db-flexible-replica-aat"
        name                     = "db_cpu_percent_cft-task-postgres-db-flexible-replica-aat"
      ~ tags                     = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-02-04T17:41:02Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_memory[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_memory" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-data-aat/providers/Microsoft.Insights/metricAlerts/db_memory_percent_cft-task-postgres-db-flexible-replica-aat"
        name                     = "db_memory_percent_cft-task-postgres-db-flexible-replica-aat"
      ~ tags                     = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-02-04T17:41:02Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_storage_utilization[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_storage_utilization" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-data-aat/providers/Microsoft.Insights/metricAlerts/db_storage_utilization_cft-task-postgres-db-flexible-replica-aat"
        name                     = "db_storage_utilization_cft-task-postgres-db-flexible-replica-aat"
      ~ tags                     = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-02-04T17:41:02Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-replica-aat"
        name                          = "cft-task-postgres-db-flexible-replica-aat"
      ~ tags                          = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-02-04T17:41:02Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_resource_group.rg[0] will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-data-aat"
        name       = "cft-task-postgres-db-flexible-replica-data-aat"
      ~ tags       = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-02-04T17:41:02Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 12 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1386,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->